Repository: sambar-fgfs/Kanboard-documentation-ja
Catalog: resource/kanboard-documentation-ja.tmx
Source language: en_us
Languages: ja

source: When I move a task to the column “Done”, automatically close this task ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: カラム “Done”にタスクを移動したら、自動的にタスクを完了する ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: - Open Calendar
ja: - カレンダーを開く

source: Formatter Overrides -------------------
ja: フォーマッターのオーバーライド -------------------

source: If the end-user submit the login form, providers that implements ``PasswordAuthenticationProviderInterface`` are executed 4.
ja: エンドユーザーがログインフォームを使用するならば、``PasswordAuthenticationProviderInterface`` 認証プロバイダ が実行されます。 4.

source: - Result on success: **number of hours**
ja: - 成功時の返り値: **消費した時間**

source: Plugin Translations -------------------
ja: プラグインの翻訳 -------------------

source: - Hires
ja: - 採用

source: - **When you run the migrations, make sure only one process is accessing to the database**
ja: - **マイグレーションを実行するとき、データベースにアクセスするプロセスが1つだけになることを確認してください**

source: There are two different ways to close a task, from the task drop-down menu on the board:
ja: タスクを完了するには2つの違う方法があり、一つはボード上のタスクのドロップダウンメニューからです:

source: Automatic Actions API Procedures ================================
ja: 自動アクションAPIのプロシージャ ================================

source: Set to false to skip the verification define('LDAP_SSL_VERIFY', false);
ja: falseにすると検証をスキップします。 define('LDAP_SSL_VERIFY', false);

source: Example for Active Directory: ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: Active Directory の例: ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: Ordered lists -------------
ja: 番号付きリスト -------------

source: - Deployed in production
ja: - 製品としてデプロイ

source: The external id is mainly used for external group providers.
ja: 外部IDは主に外部グループプロバイダにより使用されます。

source: - The subscription link is unique per user, the link is activated when you enable the public access of your user: **User profile > Public access**.
ja: - 配信リンクはユーザー毎にユニークで、 **ユーザープロフィール > 公開アクセス** で公開アクセスを有効化したときにリンクがアクティブになります。

source: - Do not under estimate the complexity of introducing changes.
ja: - 複雑さや変更点の取り込みの工数を低く見積もらないでください。

source: (or) Install Nginx and PHP:
ja: (もしくは) Nginx と PHP をインストールする:

source: - If you use another web server than Apache, for example Nginx or Microsoft IIS, you have to configure yourself the URL rewriting
ja: - NginxかMicrosoft IISのような、Apacheではないwebサーバーを使用しているなら、あなた自身がURL rewitingの設定をしなければなりません。

source: - Purpose: **Find tasks by using the search engine**
ja: - 用途: **(Kanboard内部の)検索エンジンを使用してタスクを検索する**

source: Configure the Windows Task Scheduler:
ja: Windows タスクスケジューラーを設定してください:

source: By default, Kanboard use UTC as time zone, but you can define your own time zone.
ja: デフォルトではKanboard は UTC を使用しますが、自身のタイムゾーンに合わせることができます。

source: Note: the cronjob process must have write access to the database in case you are using Sqlite.
ja: 注意: Sqliteを使用している場合はcronjobのプロセスにデータベースに書き込み権限を与える必要があります。

source: - After 3 authentication failure for the same username, the login form shows a captcha image to prevent automated bot tentatives.
ja: - 同一ユーザー名で3回認証に失敗した後は、自動botへの対策でログインフォームにcaptcha画像が表示されます。

source: - You can store your own config file on the data volume: ``/var/www/app/data/config.php``.
ja: - 自作の設定ファイルをデータボリューム上の ``/var/www/app/data/config.php`` に保存することができます。

source: // LDAP DN for administrators // Example: CN=Kanboard-Admins,CN=Users,DC=kanboard,DC=local define('LDAP_GROUP_ADMIN_DN', '');
ja: // システム管理者のLDAP 識別名 // Example: CN=Kanboard-Admins,CN=Users,DC=kanboard,DC=local define('LDAP_GROUP_ADMIN_DN', '');

source: This call is usually defined in the ``initialize()`` method.
ja: この呼び出しは ``initialize()``メソッド内の定義に使われます。

source: figure:: /_static/web-notifications-icon.png :alt: Web Notifications Icon
ja: figure:: /_static/web-notifications-icon.png :alt: Web通知アイコン

source: Project Permissions -------------------
ja: プロジェクトの権限 -------------------

source: Search by moved date with range ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: タスクの移動日を範囲検索 ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: - Nested groups are not implemented, send a pull-request if you need this feature.
ja: - ネストグループは実装されていないので、もしこの機能が必要ならプルリクエストを送ってください。

source: Generate only the attribute ``href``: ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: ``href`` 属性のみを生成する: ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

source: export:tasks Tasks CSV export
ja: export:tasks タスクをCSVでエクスポート

source: There are two different calendars in Kanboard:
ja: Kanboardには2つの異なるカレンダーがあります:

source: - Multitasking possible (not efficient)
ja: - 同時処理が可能 (効率的ではない)

source: When the task limit is reached for a column, the background becomes red.
ja: タスク数がカラムの上限に達すると、背景が赤色になります。

source: // Allow automatic LDAP user creation define('LDAP_USER_CREATION', true);
ja: // 自動でLDAP ユーザーの作成を許容する define('LDAP_USER_CREATION', true);

source: - The second argument is a PHP callable function (closure or class method)
ja: - 2つめの引数は 呼び出し可能なPHPの関数 (closure or class method) です。

source: Using your helper from a template:
ja: テンプレートからヘルパーを利用する:

source: - Ideas
ja: - アイデア

source: - Note 1: The special characters ``*`` is important here, **otherwise an exact match will be done**.
ja: - 注意1: ``*`` の特殊文字がここで重要になり、 **それ以外の部分は完全一致とされます** 。

source: // Mail transport to use: "smtp", "sendmail" or "mail" (PHP mail function)
ja: // メールの送信方法を"smtp", "sendmail" , "mail" (PHP のメール関数) から選択

source: Board API Procedures ====================
ja: ボードのAPIプロシージャ ====================

source: Usage:
ja: 使用方法:

source: By default, Kanboard includes two kinds of providers:
ja: デフォルトでは、Kanboard は2つのタイプのプロバイダを含んでいます:

source: Search events by project ~~~~~~~~~~~~~~~~~~~~~~~~
ja: プロジェクトでイベントを検索 ~~~~~~~~~~~~~~~~~~~~~~~~

source: // LDAP password to use for proxy mode define('LDAP_PASSWORD', null);
ja: // proxyモードで使用する LDAP password define('LDAP_PASSWORD', null);

source: The list of access is handled by the class ``Kanboard\Core\Security\AccessMap``.
ja: アクセスリストは ``Kanboard\Core\Security\AccessMap`` クラスでハンドルされています。

source: From the dashboard, click on the link **New private project**.
ja: ダッシュボードから **非公開プロジェクト作成** のリンクをクリックしてください。

source: +----------------------------------+-----------+----------------------------------+ | Parameter | Default | Description | | | value | | +==================================+===========+==================================+ | ``LDAP_AUTH`` | false | Enable LDAP authentication | +----------------------------------+-----------+----------------------------------+ | ``LDAP_SERVER`` | Empty | LDAP server hostname | +----------------------------------+-----------+----------------------------------+ | ``LDAP_PORT`` | 389 | LDAP server port | +----------------------------------+-----------+----------------------------------+ | ``LDAP_SSL_VERIFY`` | true | Validate certificate for | | | | ``ldaps://`` style URL | +----------------------------------+-----------+----------------------------------+ | ``LDAP_START_TLS`` | false | Enable LDAP start TLS | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USERNAME_CASE_SENSITIVE`` | false | Kanboard lowercase the ldap | | | | username to avoid duplicate | | | | users (the database is case | | | | sensitive) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_BIND_TYPE`` | anonymous | Bind type: “anonymous”, “user” | | | | or “proxy” | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USERNAME`` | null | LDAP username to use with proxy | | | | mode or username pattern to use | | | | with user mode | +----------------------------------+-----------+----------------------------------+ | ``LDAP_PASSWORD`` | null | LDAP password to use for proxy | | | | mode | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_BASE_DN`` | Empty | LDAP DN for users (Example: | | | | “CN=Users,DC=kanboard,DC=local”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_FILTER`` | Empty | LDAP pattern to use when | | | | searching for a user account | | | | (Example: | | | | “(&(objectClass=user)(sAMAccount | | | | Name=%s))”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_USERNAME`` | uid | LDAP attribute for username | | | | (Example: “samaccountname”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_FULLNAME`` | cn | LDAP attribute for user full | | | | name (Example: “displayname”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_EMAIL`` | mail | LDAP attribute for user email | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_GROUPS`` | memberof | LDAP attribute to find groups in | | | | user profile | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_PHOTO`` | Empty | LDAP attribute to find user | | | | photo (jpegPhoto or | | | | thumbnailPhoto | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_LANGUAGE`` | Empty | LDAP attribute for user language | | | | (preferredlanguage), the | | | | accepted language format is | | | | “fr-FR” | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_CREATION`` | true | Enable automatic LDAP user | | | | creation | +----------------------------------+-----------+----------------------------------+ |``LDAP_GROUP_ADMIN_DN`` | Empty | LDAP DN for administrators | | | | (Example: | | | | “CN=Kanboard-Admins,CN=Users,DC= | | | | kanboard,DC=local”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_MANAGER_DN`` | Empty | LDAP DN for managers (Example: | | | | “CN=Kanboard | | | | Managers,CN=Users,DC=kanboard,DC | | | | =local”) | +----------------------------------+-----------+----------------------------------+ |``LDAP_GROUP_PROVIDER`` | false | Enable LDAP group provider for | | | | project permissions | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_BASE_DN`` | Empty | LDAP Base DN for groups | | | | | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_FILTER`` | Empty | LDAP group filter (Example: | | | | “(&(objectClass=group)(sAMAccoun | | | | tName=%s*))“) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_USER_FILTER`` | Empty | If defined, Kanboard will search | | | | user groups in | | | | LDAP_GROUP_BASE_DN with this | | | | filter, it’s useful only for | | | | posixGroups (Example: | | | | ``(&(objectClass=posixGroup)(mem | | | | berUid=%s))``) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_ATTRIBUTE_NAME`` | cn | LDAP attribute for the group | | | | name | +----------------------------------+-----------+----------------------------------+
ja: +----------------------------------+-----------+----------------------------------+ | パラメータ | デフォルト値 | 概要 | +==================================+===========+==================================+ | ``LDAP_AUTH`` | false | LDAP 認証を有効にする | +----------------------------------+-----------+----------------------------------+ | ``LDAP_SERVER`` | Empty | LDAP サーバーのホスト名 | +----------------------------------+-----------+----------------------------------+ | ``LDAP_PORT`` | 389 | LDAP サーバーのポート番号 | +----------------------------------+-----------+----------------------------------+ | ``LDAP_SSL_VERIFY`` | true | ``ldaps://`` スタイルのURLで | | | | 証明書を検証する | +----------------------------------+-----------+----------------------------------+ | ``LDAP_START_TLS`` | false | LDAP をTLS接続で開始する | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USERNAME_CASE_SENSITIVE`` | false | Kanboard は | | | | ユーザーの重複防止のためLDAPユーザー名 で | | | | 小文字を使用する (データベースは | | | | 大文字小文字を区別する) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_BIND_TYPE`` | anonymous | バインドタイプ: “anonymous”, “user” | | | | or “proxy” | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USERNAME`` | null |プロキシモードで使用するLDAPユーザー名か、 | | | | ユーザーモードで使用するユーザー名のパターン | +----------------------------------+-----------+----------------------------------+ | ``LDAP_PASSWORD`` | null | プロキシモードで使用する | | | | LDAP パスワード | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_BASE_DN`` | Empty | LDAP DN for users (Example: | | | | “CN=Users,DC=kanboard,DC=local”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_FILTER`` | Empty | LDAPでユーザーアカウント検索に | | | | 使用するパターン | | | | (例: | | | | “(&(objectClass=user)(sAMAccount | | | | Name=%s))”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_USERNAME`` | uid | ユーザー名のLDAP属性 | | | | (例: “samaccountname”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_FULLNAME`` | cn | ユーザーのフルネームのLDAP属性 | | | | (例: “displayname”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_EMAIL`` | mail | ユーザーのEmailアドレスのLDAP属性 | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_GROUPS`` | memberof | ユーザープロフィールから | | | | グループを見つけるためのLDAP属性 | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_PHOTO`` | Empty | ユーザーの画像を見つけるための | | | | LDAP属性 (jpegPhoto or | | | | thumbnailPhoto | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_ATTRIBUTE_LANGUAGE`` | Empty | ユーザーの言語のLDAP属性 | | | | (preferredlanguage)で、 | | | | 利用できる言語のフォーマットは | | | | “fr-FR”のようになります。 | +----------------------------------+-----------+----------------------------------+ | ``LDAP_USER_CREATION`` | true | 自動的にLDAPユーザーを作成する | +----------------------------------+-----------+----------------------------------+ |``LDAP_GROUP_ADMIN_DN`` | Empty | システム管理者のLDAP識別名 | | | | (例: | | | | “CN=Kanboard-Admins,CN=Users,DC= | | | | kanboard,DC=local”) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_MANAGER_DN`` | Empty | プロジェクト管理者のLDAP識別名 | | | | (例: “CN=Kanboard Managers, | | | | CN=Users,DC=kanboard,DC | | | | =local”) | +----------------------------------+-----------+----------------------------------+ |``LDAP_GROUP_PROVIDER`` | false | プロジェクトの権限の設定のために | | | | LDAP グループプロバイダを有効にする | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_BASE_DN`` | Empty | グループのLDAP Base DN | | | | | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_FILTER`` | Empty | LDAP グループのフィルタ (例: | | | | “(&(objectClass=group)(sAMAccoun | | | | tName=%s*))“) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_USER_FILTER`` | Empty | これが定義されている場合、 | | | | KanboardはこのフィルターとLDAP_GROUP_BASE_DNで検索します。 | | | | これはposixGroupesに限って便利です。 | | | | (例: | | | | ``(&(objectClass=posixGroup)(mem | | | | berUid=%s))``) | +----------------------------------+-----------+----------------------------------+ | ``LDAP_GROUP_ATTRIBUTE_NAME`` | cn | グループ名のLDAP 属性 | +----------------------------------+-----------+----------------------------------+

source: Attribute: **createdRange**
ja: 属性: **createdRange**

source: figure:: /_static/internal-task-links.png :alt: Task Links
ja: figure:: /_static/internal-task-links.png :alt: タスクリンク

source: PHP built-in mail function ~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: PHP ビルトインのメール機能 ~~~~~~~~~~~~~~~~~~~~~~

source: Install the Apache service ~~~~~~~~~~~~~~~~~~~~~~~~~~
ja: Apache サービスをインストールする ~~~~~~~~~~~~~~~~~~~~~~~~~~

source: You need at least, these extensions in your ``php.ini``:
ja: 少なくとも、 ``php.ini`` でこれらの拡張が必要です:

source: It’s particularly useful for mobile clients with higher network latency.
ja: これは遅延が大きいネットワークを使用するモバイルクライアントで特に有用です。

source: trigger
ja: トリガー

source: - There is **NO** user management
ja: - これにはユーザー管理は **ありません**

source: How to detect the bottleneck?
ja: どうすればボトルネックを見つけられますか？

source: Installation Outside Document Root ----------------------------------
ja: ドキュメントルート外へのインストール ----------------------------------

source: You have to call the method ``register()`` from the class ``Kanboard\Core\Action\ActionManager``:
ja: ``Kanboard\Core\Action\ActionManager`` クラス内の ``register()`` メソッドを呼び出さなければなりません。 :

source: Sales ~~~~~
ja: 販売 ~~~~~

source: - Do not allow changes during the iteration
ja: - イテレーション中の変更は許容されていません

source: Authorization Workflow ----------------------
ja: 認可のワークフロー ----------------------

source: // LDAP attribute for the group name
ja: // LDAP 属性のグループ名

source: Kanboard will run database migrations automatically for you.
ja: Kanboard は自動的にデータベースのマイグレーションを実行します

source: Custom css values for one category - this is an example for displaying the text:
ja: 一つのカテゴリに対してカスタムCSSの値を設定 - この例では、表示されるテキストに適用されます:

source: Go to **Project settings > Public access**.
ja: **プロジェクト設定 > 公開アクセス** を参照してください。

source: Note: According to the Google Support, external calendars are not refreshed very often, `read the documentation <https://support.google.com/calendar/answer/37100?hl=en&ref_topic=1672445>`__.
ja: 注意:Googleサポートによると、外部カレンダーは頻繁には更新されません。`この文書を参照願います。 <https://support.google.com/calendar/answer/37100?hl=en&ref_topic=1672445>`__.

source: // LDAP bind type: "anonymous", "user" or "proxy" define('LDAP_BIND_TYPE', 'anonymous');
ja: // LDAPの認証タイプ: "anonymous", "user" or "proxy" define('LDAP_BIND_TYPE', 'anonymous');

source: Search by assignee ~~~~~~~~~~~~~~~~~~
ja: 担当者で検索 ~~~~~~~~~~~~~~~~~~

source: // Sendmail command to use when the transport is "sendmail"
ja: // "sendmail" での送信を選んだときに sendmail コマンドが使用する設定

source: Change default plugin directory URL:
ja: プラグインのディレクトリのURLを変更する:

source: - Sendmail command
ja: - Sendmail コマンド

source: Install Apache and PHP:
ja: ApacheとPHPをインストールする:

source: Always check for breaking changes if any.
ja: 重大な変更点の確認を怠らないでください。

source: The first character of the controller and the plugin name will converted in uppercase with the function ``ucfirst()``.
ja: コントローラーとプラグイン名の頭文字は ``ucfirst()`` 関数で大文字に変換されます。

source: - Item 1
ja: - 項目1

source: - Item 2
ja: - 項目2

source: - Item 3
ja: - 項目3

source: - The timer doesn’t depend of the subtask status
ja: - タイマーはサブタスクの状態に依存しません。

source: warning:: Since Kanboard v1.2.8, people with two-factor authentication enabled must use API keys.
ja: 警告:: Kanboard v1.2.8 以降では、ユーザーが2要素認証を利用するにはAPIキーを有効化しなければなりません。

source: - **action_id** (integer, required)
ja: - **action_id** (integer, 必須)

source: Continuous Integration with Travis-CI -------------------------------------
ja: Travis-CI を使用した継続的インテグレーション -------------------------------------

source: Example to add new content in the dashboard sidebar:
ja: ダッシュボードのサイドバーに新しい内容を追加する例:

source: - Encourages focus by avoiding multitasking
ja: - 複数のタスクの同時処理の回避に重点的に取り組むよう促します(訳注:元ネタでは複数の機械を使って並行作業をやる)

source: figure:: /_static/task-transitions.png :alt: Task Transitions
ja: figure:: /_static/task-transitions.png :alt: タスクの推移

source: - The methods ``getExternalIdColumn()`` and ``getExternalId()`` must return a value to sync the user
ja: - ``getExternalIdColumn()`` と ``getExternalId()`` メソッドの返り値をユーザーと同期しなければなりません。

source: +---------------------------------------+---------------------------------------------+ | Method | Description | +=======================================+=============================================+ | ``getDescription()`` | Description visible in the user interface | +---------------------------------------+---------------------------------------------+ | ``getCompatibleEvents()`` | Get the list of compatible events | +---------------------------------------+---------------------------------------------+ | ``getActionRequiredParameters()`` | Get the required parameter for the action | | | (defined by the user) | +---------------------------------------+---------------------------------------------+ | ``getEventRequiredParameters()`` | Get the required parameter for the event | +---------------------------------------+---------------------------------------------+ | ``doAction(array $data)`` | Execute the action, must return true on | | | success | +---------------------------------------+---------------------------------------------+ | ``hasRequiredCondition(array $data)`` | Check if the event data meet the action | | | condition | +---------------------------------------+---------------------------------------------+
ja: +---------------------------------------+---------------------------------------------+ | メソッド | 概要 | +=======================================+=============================================+ | ``getDescription()`` | ユーザーインターフェース内で概要を可視化 | +---------------------------------------+---------------------------------------------+ | ``getCompatibleEvents()`` | 互換性のあるイベントのリストを取得 | +---------------------------------------+---------------------------------------------+ | ``getActionRequiredParameters()`` | アクションに必要なパラメータを取得 | | | (ユーザーが定義) | +---------------------------------------+---------------------------------------------+ | ``getEventRequiredParameters()`` | イベントに必要なパラメータを取得 | +---------------------------------------+---------------------------------------------+ | ``doAction(array $data)`` | アクションを実行。成功時はtrueを | | | 返さなければならない | +---------------------------------------+---------------------------------------------+ | ``hasRequiredCondition(array $data)`` | イベントのデータがアクションを | | | 起こす条件に合ってるかチェックする | +---------------------------------------+---------------------------------------------+
